<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="keywords" content="竞彩足球预测" />
<meta name="description" content="竞彩足球预测" />
<title>竞彩足球预测 - 理论知识</title>
<link rel="stylesheet" href="style/css.css" type="text/css" media="all" />
<script src="jquery-1.3.2.min.js" type="text/javascript"></script>
<script src="js/js.js" type="text/javascript"></script>
</head>
<body>
<?php include_once('head.php'); ?>

<div class="page">

<div id="main">
    <h1>竞彩理论知识</h1>
	<hr />
<div id="text2"><img src="images/1.png" /></div>
<?php if(file_exists($file)){  }else{ ?>
<div id='text3'>
    
    

   
    <span><p class="p1">理论知识</p></span>
    <span><p class="p2">1、进球率预测法</p></span>
    <span>足彩中的大小球是奖金很高的一项彩票，需要预测多场比赛的进球数量，下面我来分享一下进球率的预测方法</span>
    <span>在1990年的伦敦国际波彩会议上，大卫·杰克逊和K.R.莫舍斯基提交了一篇名为《比赛中的指数波彩》的论文。在该论文中，他们认为某场赛事的结果是与参赛球队在以往的进球率有关系的，因此可以通过考察参赛球队以往的进球率来预测比赛结果。</span>
    <span>以Ra表示参赛的A队以往的进球率，以Rb表示参赛的B队以往的进球率；则本场赛事的总进球数即可以用Ra+Rb来预测，而两队的胜负则可以用Ra-Rb来预测。</span>
    <span><p class="p2">准则1、当参赛双方的平均进球率之差为0.30（不含0.30）以上时平均进球率高的球队胜；</p></span>
    <span><p class="p2">准则2、当参赛双方的平均进球率之差为0.10以上至0.30（含0.30）时，若主场球队的平均进球率高，则主场球队胜；</p></span>
    <span><p class="p2">准则3、当参赛双方平均进球率之差为0.10以上至0.30（含0.30）时，若主场球队平均进球率低于客场球队的平均进球率，则主场球队胜或平。</p></span>
    <span><p class="p2">准则4、当参赛双方平均进球率之差为0.10（含0.10）以下时，主场球队胜或平。</p></span>
    <span>这四个预测准则既考虑了球队实力，又考虑了主客场因素。</span>
    <span>杰克逊和莫舍斯基在论文中还以1990年7月在意大利举行的世界杯比赛中英格兰队对爱尔兰队的比赛为例，对他们的理论的应用进行了检验。</span>
    <span>英格兰队在主要国际赛事中平均进球率为1.29，而爱尔兰队的平均进球率是0.73。应用他们的方法，英格兰队胜爱尔兰队的可能性为0.56(=1.29-0.73),而预测的“总进球数”为2.02(=1.29+0.73)。赛前指数波彩公司开出的英格兰胜的指数为0.85-1.1,总进球数指数为2.1-2.4。因为总进球数指数与应用这一方法所得出的预测结果很相近，所以在这方面下注赢彩机会几乎没有。不过，英格兰胜的指数最低为0.85，比起运用杰克逊-莫舍斯基方法得出的预测数字0.56要高出很多，这就意味着卖出这一指数是有利可图的。</span>
    <span>这场比赛以1-1的平局告终，给卖出英格兰胜指数的下注者带来的利润是0.85X单位赌注。对该场比赛而言，杰克逊和莫舍斯基的预测方法是很准确的，但遗憾的是他们没有进一步给出将该方法运用于其他比赛的例子。
该方法的特点是看来很有道理，而且应用也简便。但该方法主要适用于指数博彩，对于我国目前只竞猜“胜、平、负”的方式来说，并不适用。但其用进球率来预测比赛结果的方法，值得我们借鉴。</span>
    
    <span><p class="p2">2、埃罗预测法</p></span>
    <span>埃罗预测法是美国物理学家aroad elo博士创立的，elo博士最早将这套方法用于预测国际象棋的比赛结果。他在自己的《棋分高下：过去和现在》一书中对该方法作了详细说明，通过对1500场英超比赛的研究，杰奎斯·布莱克对elo预测法进行了不懈地改进，现已经被广泛应用足球赛事中。elo预测法的改进模型是通过研究主客场球队在比赛前的积分情况来预测胜负的，elo预测法的预测回归方程式为：
主场球队取胜的可能性 =44．8% +（0．53%乘以两队积分差）
客场球队的获胜可能性=24．5% -（两队积分差乘以0．39%）</span>

    <span><p class="p2">3、六场预测法</p></span>
    <span>一、六场预测法的使用方法


改进后的方法为，根据参赛两对实力或状态差异设定差异值，进而根据该差异值来预测比赛结果。

具体的计算方法为：某球队最近的6场的比赛结果中，每胜1场（即1个W）计为3分，每平1场（即1

个X）计为1分，每负1场（即1个L）计为0分。如若某队在之前的6场全赢，即按照六场预测法为WWWWWW，则该队得分为18分；若为LLLLLL，则计为0分：若是WLXXWW则计为11分。</span>
    <span>二、预测定义


六场预测法同样要受主客场因素和球队实力所制约。应用改进后的6场预测法，对英超和意甲联赛近600场比赛进行了预测，得出如下预测定义。

定义1：当交战的两队六场积分差为6或6以上时，六场积分高的球队胜；

定义2：当交战的两队六场积分差为5时，若主场球队六场积分高，则主场球队胜；

若主场球队六场积分低，则主场球队胜或平；

定义3：当交战的两队六场积分差为2 4时，则六场积分高的球队胜。

定义4：当交战的两队六场积分差为1或0时，则主场球队胜或平。</span>

    
 <span><p class="p1">动手实践</p></span>
    <span><p class="p2">进球率预测法</p></span>
    <span>以2015年3月11日 西悉尼流浪者对墨尔本城为例, 西悉尼流浪者近6场进球率为 (0+2+3+3+1+1)/6 = 1.67, 墨尔本城近6场进球率为 (0+3+0+0+0+2)/6 = 0.83, 计算 Ra - Rb = 1.67 - 0.83 = 0.84, 0.84 > 0.30, 预测西悉尼流浪者胜利，比赛结果为 西悉尼流浪者对墨尔本城 3:2， 预测成功</span>
</div>
<?php } ?>

	<div class="text">
        nothing
	</div>
	
</div>

</div>


<div id="block_footer">
	<div class="foot"><span>Copyright © 2015-2015 design by J</span></div>
</div>

</body></html>
<?php include_once('foot.php'); ?>